# This Python file uses the following encoding: utf-8
from transformers import XLMRobertaForQuestionAnswering
from transformers import AutoTokenizer
from transformers import pipeline
import torch

# Gholamreza/distilbert-fa-zwnj-base-finetuned-2epoch-pquad
# speed_model_but_low_focus = "ForutanRad/bert-fa-QA-v1"
# good focus same as pedramyazdipour = "phd411r1/SajjadAyoubi_xlm-roberta-large-fa-qa_finetune_on_hoshfa_3"
device = 'cuda' if torch.cuda.is_available() else 'cpu'
model1 = XLMRobertaForQuestionAnswering.from_pretrained("pedramyazdipoor/persian_xlm_roberta_large")
tokenizer1 = AutoTokenizer.from_pretrained("pedramyazdipoor/persian_xlm_roberta_large")

roberta_large = pipeline(task='question-answering', model=model1, tokenizer=tokenizer1)


def Q_A(question, context):
    answer_pedram = roberta_large({"question": question, "context": context})['answer']
    return answer_pedram

context = '''
ماده ۱۱ – اموال بر دو قسم است منقول و غیرمنقول.
ماده ۱۲ – مال غیرمنقول آن است که از محلی بمحل دیگر نتوان نقل نمود اعم از این‌که استقرار آن ذاتی باشد یا بواسطه عمل انسان نحوی که نقل آن مستلزم خرابی یا نقص خود مال یا محل آن شود.
ماده ۱۳ – اراضی و ابنیه و آسیا و هر چه که در بنا منصوب و عرفاً جزء بنا محسوب می‌شود غیر‌منقول است و هم‌چنین است لوله‌‌ها که برای جریان آب یا مقاصد دیگر در زمین یا بنا کشیده شده باشد.
ماده ۱۴ – آینه و پرده نقاشی و مجسمه و امثال آن‌ها در صورتی‌که در بنا یا زمین بکار رفته باشد بطوری‌که نقل آن موجب نقص یا خرابی خود آن یا محل آن بشود غیرمنقول است.
ماده ۱۵ – ثمره و حاصل مادام که چیده یا درو نشده است غیرمنقول است اگر قسمتی از آن چیده یا درو شده باشد تنها آن قسمت منقول است.
ماده ۱۶ – مطلق اشجار و شاخه‌های آن و نهال و قلمه مادام که بریده یا کنده نشده است غیرمنقول است.
ماده ۱۷ – حیوانات و اشیائی که مالک آن را برای عمل زراعت اختصاص داده باشد از قبیل گاو و گاومیش و ماشین و اسباب و ادوات زراعت و تخم‌و غیره و بطور کلی هر مال منقول که برای استفاده از عمل زراعت لازم و مالک آن را باین امر تخصیص داده باشد از جهت صلاحیت محاکم و توقیف اموال جزو ملک محسوب و در حکم مال غیرمنقول است و هم‌چنین است تلمبه و گاو و یا حیوان دیگری که برای آبیاری زراعت یا خانه و باغ اختصاص داده شده است.
ماده ۱۸ – حق انتفاع از اشیاء غیرمنقوله مثل حق عمری و سکنی و هم‌چنین حق ارتفاق نسبت بملک غیر از قبیل حق‌العبور و حق‌المجری و‌دعاوی راجعه باموال غیرمنقوله از قبیل تقاضای خلع ید و امثال آن تابع اموال غیرمنقول است.
ماده ۱۹ – اشیائی که نقل آن از محلی به محل دیگر ممکن باشد بدون اینکه بخود یا محل آن خرابی وارد آید منقول است.
ماده ۲۰ – کلیه دیون از قبیل قرض و ثمن مبیع و مال‌الاجاره عین مستأجره از حیث صلاحیت محاکم در حکم منقول است ولو اینکه مبیع یا عین مستأجره از اموال غیرمنقوله باشد.
ماده ۲۱ – انواع کشتی‌های کوچک و بزرگ و قایق‌ها و آسیاها و حمام‌هایی‌که در روی رودخانه و دریاها ساخته می‌شود و می‌توان آن‌ها را حرکت داد و‌کلیه کارخانه‌هایی‌که نظر بطرز ساختمان جزو بنای عمارتی نباشد داخل در منقولات است ولی توقیف بعضی از اشیاء مزبوره ممکن است نظر به اهمیت آن‌ها موافق ترتیبات خاصه به‌عمل آید.
ماده ۲۲ – مصالح بنائی از قبیل سنگ و آجر و غیره که برای بنائی تهیه شده یا بواسطه خرابی از بنا جدا شده باشد مادامی‌که در بنا بکار نرفته داخل منقول است.
فصل سوم – در اموالی که مالک خاص ندارد
ماده ۲۳ – استفاده از اموالی که مالک خاص ندارد مطابق قوانین مربوطه بآن‌ها خواهد بود.
ماده ۲۴ – هیچ‌کس نمی‌تواند طرق و شوارع عامه و کوچه‌هایی را که آخر آن‌ها مسدود نیست تملک نماید.
ماده ۲۵ – هیچ‌کس نمی‌تواند اموالی را که مورد استفاده عموم است و مالک خاص ندارد از قبیل پل‌ها و کاروانسراها و آب‌انبارهای عمومی و‌مدارس قدیمه و میدان‌گاه‌های عمومی تملک کند.و هم‌چنین است قنوات و چاه‌هایی که مورد استفاده عموم است.
ماده ۲۶ – اموال دولتی که معد است برای مصالح یا انتفاعات عمومی مثل استحکامات و قلاع و خندق‌ها و خاکریزهای نظامی و قورخانه و اسلحه و ذخیره و سفاین جنگی و هم‌چنین اثاثه و ابنیه و عمارات دولتی و سیم‌های تلگرافی دولتی و موزه‌ها و کتابخانه‌های عمومی و آثار تاریخی و امثال آن‌ها و بالجمله آن‌چه از اموال منقوله و غیرمنقوله که دولت بعنوان مصالح عمومی و منافع ملی در تحت تصرف دارد، قابل تملک خصوصی نیست و هم‌چنین اموالی که موافق مصالح عمومی به ایالت و ولایت یا ناحیه یا شهری اختصاص یافته باشد.
ماده ۲۷ – اموالی که ملک اشخاص نمی‌باشد و افراد مردم می‌توانند آن‌ها را مطابق مقررات مندرجه در این قانون و قوانین مخصوصه مربوطه بهر‌یک از اقسام مختلفه آن‌ها تملک کرده و یا از آن‌ها استفاده کنند مباحات نامیده می‌شود مثل اراضی موات یعنی زمین‌هایی که معطل افتاده و آبادی و کشت و‌زرع در آن‌ها نباشد.
ماده ۲۸ – اموال مجهول‌المالک با اذن حاکم یا مأذون از قبل او بمصارف فقرا می‌رسد.
باب دوم – در حقوق مختلفه که برای اشخاص نسبت باموال حاصل می‌شود
ماده ۲۹ – ممکن است اشخاص نسبت باموال علاقه‌های ذیل را دارا باشند:  مالکیت (‌اعم از عین یا منفعت) , حق انتفاق , حق ارتفاق به ملک غیر
'''

question = "افراد به اموال ممکن است چه علاقه هایی داشته باشند؟"

answer = Q_A(question, context)
print(answer)
